var heroID = argument0;

var msg;
msg[0] = "";
msg[1] = "";
msg[2] = "";

switch(heroID)
{
    case 1:// 刘备
    msg[0] = "装甲 +25%";
    msg[1] = "攻击 +25%";
    msg[2] = "【魅力】伙伴率+50%";
    break;
    case 2:// 关羽
    msg[0] = "攻速 +25%";
    msg[1] = "攻击 +25%";
    msg[2] = "【武圣】装甲+50%";
    break;
    case 3:// 张飞
    msg[0] = "装甲 +20%";
    msg[1] = "攻速 +25%";
    msg[2] = "【会心】攻击+25%";
    break;
    case 4:// 赵云
    msg[0] = "装甲+20%";
    msg[1] = "攻击 +25%";
    msg[2] = "【当千】攻速 +50%";
    break;
    case 5:// 马超
    msg[0] = "攻速 +25%";
    msg[1] = "装甲 +20%";
    msg[2] = "【破甲】攻击+50%";
    break;
    case 6:// 黄忠
    msg[0] = "装甲 +20%";
    msg[1] = "弹速 +50%";
    msg[2] = "【鹰眼】视野+25%";
    break;
    case 7:// 诸葛亮
    msg[0] = "装甲 +25%";
    msg[1] = "视野 +50%";
    msg[2] = "【连弩】攻速+100%";
    break;
    case 8:// 庞统
    msg[0] = "视野 +50%";
    msg[1] = "装甲 +20%";
    msg[2] = "【寒冰】50%冻结敌人";
    break;
    case 9:// 魏延
    msg[0] = "装甲 +20%";
    msg[1] = "攻速 +40%";
    msg[2] = "【麻痹】50%缓速敌人";
    break;
    case 10:// 关平
    msg[0] = "装甲 +20%";
    msg[1] = "攻击 +25%";
    msg[2] = "【先机】团队视野+10%";
    break;
    case 11:// 华佗
    msg[0] = "攻速 +20%";
    msg[1] = "装甲 +20%";
    msg[2] = "【疗伤】50%击中时补血";
    break;
    case 12:// 张苞
    msg[0] = "攻速 +20%";
    msg[1] = "攻击 +25%";
    msg[2] = "【一心】团队攻击+10%";
    break;
    case 13:// 孟获
    msg[0] = "攻速 +50%";
    msg[1] = "视野 +50%";
    msg[2] = "【爆轰】炸弹范围+50%";
    break;
    case 14:// 祝融
    msg[0] = "视野 +50%";
    msg[1] = "装甲 +20%";
    msg[2] = "【幸运】宝箱钱币增量";
    break;
    case 15:// 姜维
    msg[0] = "装甲 +20%";
    msg[1] = "攻击 +25%";
    msg[2] = "【统率】团队攻速+10%";
    break;
    case 16:// 吕布
    msg[0] = "攻击 +50%";
    msg[1] = "攻速 +100%";
    msg[2] = "【无双】50%一击必杀";
    break;
}
return msg;
