var heroID = argument0;

var msg;
msg[0] = "";
msg[1] = "";
msg[2] = "";

switch(heroID)
{
    case 1:// 劉備
    msg[0] = "裝甲 +25%";
    msg[1] = "攻擊 +25%";
    msg[2] = "【魅力】夥伴率+50%";
    break;
    case 2:// 關羽
    msg[0] = "攻速 +25%";
    msg[1] = "攻擊 +25%";
    msg[2] = "【武聖】裝甲+50%";
    break;
    case 3:// 張飛
    msg[0] = "裝甲 +20%";
    msg[1] = "攻速 +25%";
    msg[2] = "【會心】攻擊+25%";
    break;
    case 4:// 趙雲
    msg[0] = "裝甲+20%";
    msg[1] = "攻擊 +25%";
    msg[2] = "【當千】攻速 +50%";
    break;
    case 5:// 馬超
    msg[0] = "攻速 +25%";
    msg[1] = "裝甲 +20%";
    msg[2] = "【破甲】攻擊+50%";
    break;
    case 6:// 黃忠
    msg[0] = "裝甲 +20%";
    msg[1] = "彈速 +50%";
    msg[2] = "【鷹眼】視野+25%";
    break;
    case 7:// 諸葛亮
    msg[0] = "裝甲 +25%";
    msg[1] = "視野 +50%";
    msg[2] = "【連弩】攻速+100%";
    break;
    case 8:// 龐統
    msg[0] = "視野 +50%";
    msg[1] = "裝甲 +20%";
    msg[2] = "【寒冰】50%凍結敵人";
    break;
    case 9:// 魏延
    msg[0] = "裝甲 +20%";
    msg[1] = "攻速 +40%";
    msg[2] = "【麻痺】50%緩速敵人";
    break;
    case 10:// 關平
    msg[0] = "裝甲 +20%";
    msg[1] = "攻擊 +25%";
    msg[2] = "【先機】團隊視野+10%";
    break;
    case 11:// 華佗
    msg[0] = "攻速 +20%";
    msg[1] = "裝甲 +20%";
    msg[2] = "【療傷】50%擊中時補血";
    break;
    case 12:// 張苞
    msg[0] = "攻速 +20%";
    msg[1] = "攻擊 +25%";
    msg[2] = "【一心】團隊攻擊+10%";
    break;
    case 13:// 孟獲
    msg[0] = "攻速 +50%";
    msg[1] = "視野 +50%";
    msg[2] = "【爆轟】炸彈範圍+50%";
    break;
    case 14:// 祝融
    msg[0] = "視野 +50%";
    msg[1] = "裝甲 +20%";
    msg[2] = "【幸運】寶箱錢幣增量";
    break;
    case 15:// 姜維
    msg[0] = "裝甲 +20%";
    msg[1] = "攻擊 +25%";
    msg[2] = "【統率】團隊攻速+20%";
    break;
    case 16:// 呂布
    msg[0] = "攻擊 +50%";
    msg[1] = "攻速 +100%";
    msg[2] = "【無雙】50%一擊必殺";
    break;
}

return msg;







